## **Experiment 11**

### **Name : Smayan Kulkarni, SAP ID : 60009230142 , Roll Number : D100, Division : D2-2**

In [1]:
import pandas as pd 
import numpy as np

1. In the Titanic dataset, fill missing values in the embarked column with the mode of that column.

In [2]:
titanic = pd.read_csv('titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
mode = titanic['Embarked'].mode()
print(mode)

titanic['Embarked'] = titanic['Embarked'].fillna(mode[0])
titanic['Embarked'].isna().sum()

0    S
Name: Embarked, dtype: object

0

2. In the Titanic dataset, normalize the fare column to have values between 0 and 1.

In [4]:
titanic['Fare'] = (titanic['Fare'] - titanic['Fare'].min()) / (titanic['Fare'].max() - titanic['Fare'].min())
print(titanic['Fare'].min(), titanic['Fare'].max())

0.0 1.0


3. In the Titanic dataset, create a new feature is_minor that indicates if the passenger is under 18 years old.

In [5]:
titanic['is_minor'] = (titanic['Age'] < 18)
titanic['is_minor']

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: is_minor, Length: 891, dtype: bool

4. In the Iris dataset, replace missing values in any column with the median of that column.

In [6]:
iris = pd.read_csv('Iris.csv')

iris.isna().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

5. In the Iris dataset, use one-hot encoding to convert the species column to numeric values.

In [7]:
iris['Species'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [8]:
dummies = pd.get_dummies(iris['Species'])
dummies

     Iris-setosa  Iris-versicolor  Iris-virginica
0              1                0               0
1              1                0               0
2              1                0               0
3              1                0               0
4              1                0               0
..           ...              ...             ...
145            0                0               1
146            0                0               1
147            0                0               1
148            0                0               1
149            0                0               1

[150 rows x 3 columns]


6. In the Iris dataset, standardize the sepal length (cm) column to have a mean of 0 and a standard deviation of 1.

In [9]:
mean = iris['SepalLengthCm'].mean()
std = iris['SepalLengthCm'].std()

normalized = []
for i in iris['SepalLengthCm']:
    norm = (i - mean) / std
    normalized.append(norm)

print(np.mean(normalized), np.std(normalized))

-5.210646728907401e-16 0.9966610925150703

7. In the Boston Housing dataset, remove rows where the CHAS column has missing values.

In [10]:
boston = pd.read_csv('boston.csv')
boston.isna().sum()

ID         0
crim       0
zn         0
indus      0
chas       0
nox        0
rm         0
age        0
dis        0
rad        0
tax        0
ptratio    0
black      0
lstat      0
medv       0
dtype: int64


8. In the Boston Housing dataset, detect and remove outliers in the TAX column using the IQR method.

In [11]:
tax = boston['tax']

Q1 = tax.quantile(0.25)
Q3 = tax.quantile(0.75)

IQR  = Q3 - Q1

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR

outliers = boston[(tax < lower_bound) | (tax > upper_bound)]
outliers

Empty DataFrame
Columns: [ID, crim, zn, indus, chas, nox, rm, age, dis, rad, tax, ptratio, black, lstat, medv]
Index: []

9. In the Boston Housing dataset, replace missing values in the DIS column with the median value of that column.

In [12]:
boston['dis'].isna().sum()

0


10. In the Wine Quality dataset, drop duplicate rows based on all columns.

In [13]:
wine = pd.read_csv('winequality-red.csv')

wine.drop_duplicates(inplace=True)
wine.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
5,7.4,0.66,0.00,1.8,0.075,13.0,40.0,0.9978,3.51,0.56,9.4,5

11. In the Wine Quality dataset, fill missing values in the citric acid column with the mean of that column.

In [14]:
wine['citric acid'].isna().sum()

0

12. In the Wine Quality dataset, identify and drop outliers in the pH column using Z- scores.

In [15]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()

todetectoutliers= scaler.fit_transform(wine[['pH']])
outliers = []

for val in todetectoutliers:
    if val > 3.0 or val < -3.0:
        outliers.append(val)

outliers
finaloutliers = scaler.inverse_transform(outliers)
finaloutliers

array([[3.9 ],
       [3.85],
       [2.74],
       [3.9 ],
       [3.78],
       [3.78],
       [4.01],
       [4.01]])